  # Challenge

  ## Identifying Outliers using Standard Deviation

In [4]:
# initial imports
import pandas as pd
import numpy as np
import random
from sqlalchemy import create_engine

In [5]:
# create a connection to the database
engine = create_engine("postgresql://postgres:postgres@localhost:5432/fraud_detection")

In [6]:
# build a dataframe using an SQL query
query_outliers = """
SELECT card_holder_id, EXTRACT (month FROM creat_date ) AS month_transaction, 
EXTRACT (day FROM creat_date ) AS day_transaction,
amount, transactions_id, card_number, merchant_id
FROM credit_card
LEFT JOIN transaction 
ON card = card_number     
ORDER BY card_number ASC;
"""
card_holders_outliers_df = pd.read_sql(query_outliers, engine)
card_holders_outliers_df.head(4)

,card_holder_id,month_transaction,day_transaction,amount,transactions_id,card_number,merchant_id
0,11,5.0,9.0,4.60,411,180098539019105,7
1,11,11.0,10.0,3.27,835,180098539019105,94
2,11,5.0,9.0,4.09,40,180098539019105,1
3,11,4.0,6.0,1.02,861,180098539019105,50

In [24]:
df_mean = card_holders_outliers_df.groupby('card_number').mean()
df_mean.head(5)

,card_holder_id,month_transaction,day_transaction,amount,transactions_id,merchant_id
card_number,,,,,,
180098539019105,11.0,6.013699,14.808219,8.380000,1583.726027,74.561644
213193946980303,10.0,5.757143,15.242857,8.367429,1552.942857,72.557143
30063281385429,8.0,6.034483,13.465517,7.232759,1621.000000,69.293103
30078299053512,3.0,7.482759,14.982759,139.172241,1426.017241,78.896552
30142966699187,24.0,6.210526,15.087719,127.589825,1894.052632,67.087719

In [52]:
# in the function we first group by 'card_number' and 'std',
# then by 'card_number' and 'mean'
# and we use the 'card_number as parameter'
def mean_sd_card_number(number):
    df_std = card_holders_outliers_df.groupby('card_number').std()
    df_mean = card_holders_outliers_df.groupby('card_number').mean()
    number = str(number)
    
    # We return the mean and std for a specific credit_card
    # to get an idea of possible outliers
    return (df_mean.loc[number,'amount'],df_std.loc[number,'amount'])

### Outliers for first credit card

In [53]:
params = mean_sd_card_number(4263694062533017)
params

(9.49596153846154, 5.720587951277003)

In [54]:
# build a dataframe for specific card_number
query_4263694062533017 = """
SELECT amount
FROM credit_card
LEFT JOIN transaction 
ON card = card_number
WHERE card_number = '4263694062533017'
ORDER BY amount ASC;
"""
card_4263694062533017_df = pd.read_sql(query_4263694062533017, engine)
card_4263694062533017_df.sample(5)

    amount
19    7.68
14    4.49
29   10.69
3     1.93
28   10.55

In [55]:
# find anomalous transactions for random card holder
params = mean_sd_card_number(4263694062533017)
# we assume normality and use 95% cutoff
cutoff = params[0] + 2*params[1]
data = card_4263694062533017_df.loc[:,'amount']
# identify outliers
outliers = [x for x in data if x > cutoff]
print(f' the ouliers amounts for card 4263694062533017 are: {outliers}')

 the ouliers amounts for card 4263694062533017 are: [21.5]

### Outliers for second credit card

In [56]:
mean_sd_card_number(501809222273)

(8.78582089552239, 5.380704625833485)

In [57]:
# build a dataframe for specific card_number
query_501809222273 = """
SELECT amount
FROM credit_card
LEFT JOIN transaction 
ON card = card_number
WHERE card_number = '501809222273'
ORDER BY amount ASC;
"""
card_501809222273_df = pd.read_sql(query_501809222273, engine)
card_501809222273_df.sample(5)

    amount
2     1.48
19    4.51
28    7.07
56   14.91
11    2.87

In [58]:
# find anomalous transactions for random card holder
params = mean_sd_card_number(501809222273)
# we assume normality and use 95% cutoff
cutoff = params[0] + 2*params[1]
data = card_501809222273_df.loc[:,'amount']
# identify outliers
outliers = [x for x in data if x > cutoff]
print(f' the ouliers amounts for card 501809222273 are: {outliers}')

 the ouliers amounts for card 501809222273 are: [19.55, 19.87]

### Outliers for third credit card

In [62]:
mean_sd_card_number(675911140852)

(9.762790697674417, 5.5362404836896975)

In [63]:
# build a dataframe for specific card_number
query_675911140852 = """
SELECT amount
FROM credit_card
LEFT JOIN transaction 
ON card = card_number
WHERE card_number = '675911140852'
ORDER BY amount ASC;
"""
card_675911140852_df = pd.read_sql(query_675911140852, engine)
card_675911140852_df.sample(5)

    amount
39   16.99
9     3.79
42   18.52
19   10.26
7     3.13

In [64]:
# find anomalous transactions for random card holder
params = mean_sd_card_number(675911140852)
# we assume normality and use 95% cutoff
cutoff = params[0] + 2*params[1]
data = card_675911140852_df.loc[:,'amount']
# identify outliers
outliers = [x for x in data if x > cutoff]
print(f' the ouliers amounts for card 675911140852 are: {outliers}')

 the ouliers amounts for card 675911140852 are: []

  ## Identifying Outliers Using Interquartile Range

In [ ]:
# code a function to identify outliers based on interquartile range

In [ ]:
# find anomalous transactions for 3 random card holders